import { ageClassification, getWeekDay } from "./main.js";


describe('Тестування функції ageClassification', () => {
    it('Функція повертає тип данних null коли юзер не задає параметр', () => {
        expect(ageClassification()).toBeNull();
    })

    it('Функція повертає тип данних NaN коли юзер задає параметр, який не являється числом', () => {
        expect(ageClassification('@')).toBeNaN();
    })

    it('Функція повертає тип данних null коли юзер задає параметр, який менше 0', () => {
        expect(ageClassification(-1)).toBeNull();
    })

    it('Функція повертає "Дитинство" коли юзер задає параметр, який є = або > 0 а одночас є < 24', () => {
        expect(ageClassification(0)).toBe('Дитинство');
    })

    it('Функція повертає "Молодість" коли юзер задає параметр, який є > або = 25 а одночас є < 44', () => {
        expect(ageClassification(25)).toBe('Молодість');
    })

    it('Функція повертає "Зрілість" коли юзер задає параметр, який є > або = 45 а одночас є < 65', () => {
        expect(ageClassification(47)).toBe('Зрілість');
    })

    it('Функція повертає "Старість" коли юзер задає параметр, який є > або = 66 а одночас є < 75', () => {
        expect(ageClassification(70)).toBe('Старість');
    })

    it('Функція повертає "Довголіття" коли юзер задає параметр, який є > або = 76 а одночас є < 90', () => {
        expect(ageClassification(88)).toBe('Довголіття');
    })

    it('Функція повертає "Рекорд" коли юзер задає параметр, який є > або = 91 а одночас є < 122', () => {
        expect(ageClassification(115)).toBe('Рекорд');
    })

    it('Функція повертає "Неможливо" коли юзер задає параметр, який є > 122', () => {
        expect(ageClassification(130)).toBe('Неможливо');
    })

})

describe('Тестування функції getWeekDay', () => {
    it('Функція повертає тип данних null коли юзер не задає параметр', () => {
        expect(getWeekDay()).toBeNull();
    })

    it('Функція повертає тип данних null коли юзер задає параметр, який не являється числом', () => {
        expect(getWeekDay('@')).toBeNull();
    })

    it('Функція повертає тип данних null коли юзер задає параметр, який менше 0 або більше 7', () => {
        expect(getWeekDay(-1)).toBeNull();
    })

    it('Функція повертає "Понеділок" коли юзер задає параметр, який  = 1', () => {
        expect(getWeekDay(1)).toBe('Понеділок');
    })

    it('Функція повертає "Вівторок" коли юзер задає параметр, який  = 2', () => {
        expect(getWeekDay(2)).toBe('Вівторок');
    })

    it('Функція повертає "Середа" коли юзер задає параметр, який  = 3', () => {
        expect(getWeekDay(3)).toBe('Середа');
    })

    it('Функція повертає "Четвер" коли юзер задає параметр, який  = 4', () => {
        expect(getWeekDay(4)).toBe('Четвер');
    })

    it('Функція повертає "Пʼятниця" коли юзер задає параметр, який  = 5', () => {
        expect(getWeekDay(5)).toBe('Пʼятниця');
    })

    it('Функція повертає "Субота" коли юзер задає параметр, який  = 6', () => {
        expect(getWeekDay(6)).toBe('Субота');
    })

    it('Функція повертає "Неділя" коли юзер задає параметр, який  = 7', () => {
        expect(getWeekDay(7)).toBe('Неділя');
    })

})